1. What are different collection datatypes in Python? How do they differ from one another?

In [2]:
"""
1. Boolean operators - Used for comparing data
    ->  a. 'and' - takes two arguments and will evaluates to False unless both inputs are True.
        b. 'or' - the value is True unless both of its inputs are False
        c. 'not' - 
2. Numeric data type - Used for defining numerical data types
    ->  a. 'int' - integers, which are positive or negative whole numbers with no decimal point
        b. 'float' - real numbers and is written with a decimal point dividing the integer and fractional parts
        c. 'complex' - returns a complex number when real and imaginary parts are provided, or it converts a string to a complex number
3. Sequence data type - Used to define and perform operations on a collection data type variable. 
    ->  a. 'list' - which is ordered, changeable, and allows duplicate values
        b. 'tuple' - which is immutable - you can't change elements in the list
        c. 'range' - returns an immutable sequence of numbers between the given start integer to the stop integer
4. Text sequence data type - Used to define and utilize character arrays in a program
    ->  'str' - sequences of character data.
5. Mapping data type - Used for defining a dictionary with words and meanings attached to the words
    ->  'dict' - used to store data values in key:value pairs
6. Set data type - A string object that can have zero or more values
    ->  a. 'set' - used to store multiple items in a single variable
        b. 'frozenset' - takes an iterable object as input and makes them immutable
7. Binary data type - A statistical data type consisting of categorical data that can take exactly two possible values
    ->  a. 'bytes' - used to manipulate binary data, specifically, it returns a immutable bytes object initialized with the given size and data.
        b. 'bytearray' - used to manipulate binary data, specifically, it returns a bytearray object which is an array of the given bytes.
        c. 'memoryview' - access the memory of other binary object without copying the actual data

"""

"\n1. Boolean operators - Used for comparing data\n    a. 'and'\n    b. 'or'\n    c. 'not'\n2. Numeric datatype - Used for defining numerical data types\n    a. 'int'\n    b. 'float'\n    c. 'complex'\n3. Sequence datatype - Used to define and perform operations on a collection data type variable. \n    a. 'list'\n    b. 'tuple'\n    c. 'range'\n4. Text sequence datatype - Used to define and utilize character arrays in a program\n    'str'\n5. Mapping datatype - Used for defining a dictionary with words and meanings attached to the words\n    'dict'\n\n"

2. Create a DataFrame using a dictionary that looks like below. Name the DataFrame as emp_df

In [3]:
import pandas as pd
data_dict = {'name': ['Nancy','Andrew','Janet','Margaret','Steven'],
             'monthly_salary':[5000,4000,6000,3000,2000],
             'zip':[98122,98401,98033,98052,98051]}
emp_df = pd.DataFrame(data_dict)
print(emp_df)
print('\n', type(emp_df))

       name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
4    Steven            2000  98051

 <class 'pandas.core.frame.DataFrame'>

3. From emp_df print the first row

In [4]:
emp_df.iloc[0]

name              Nancy
monthly_salary     5000
zip               98122
Name: 0, dtype: object

4. From emp_df print the last row

In [5]:
emp_df.iloc[4]

name              Steven
monthly_salary      2000
zip                98051
Name: 4, dtype: object

5. Print the shape and size of emp_df

In [6]:
print('The shape of dataframe emp_df is:', emp_df.shape)   
print('The size of dataframe emp_df is:', emp_df.size)

The shape of dataframe emp_df is: (5, 3)
The size of dataframe emp_df is: 15

6. Calculate the average salary for all the employees in emp_df

In [7]:
print('The average salary for all employees is: $',emp_df['monthly_salary'].mean())

The average salary for all employees is: $ 4000.0

7. Sort the emp_df by name in ascending order

In [8]:
emp_df.sort_values('name')

       name  monthly_salary    zip
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
0     Nancy            5000  98122
4    Steven            2000  98051

8. Show only the row for employee who lives in zip code 98033

In [9]:
temp=emp_df[emp_df['zip'] == 98033]
temp

    name  monthly_salary    zip
2  Janet            6000  98033

9. Create a new column annual_salary in emp_df using column monthly_salary

In [10]:
emp_df["annual_salary"]=emp_df["monthly_salary"]*12
emp_df["annual_salary"].head()
emp_df

       name  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

10. Rename the column name to firstname

In [41]:
emp_df.rename(columns={'name':'firstname'}, inplace=True)
list(emp_df.columns.values)

['firstname', 'monthly_salary', 'zip', 'annual_salary']

In [43]:
emp_df

  firstname  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

11. Create another DataFrame named emp_info using emp_df but only choose
columns firstname, and annual_salary, zip in it

In [49]:
emp_info=emp_df[['firstname','annual_salary','zip']]
emp_info

  firstname  annual_salary    zip
0     Nancy          60000  98122
1    Andrew          48000  98401
2     Janet          72000  98033
3  Margaret          36000  98052
4    Steven          24000  98051

12. Print only column firstname from emp_info

In [44]:
emp_info['firstname']

0       Nancy
1      Andrew
2       Janet
3    Margaret
4      Steven
Name: firstname, dtype: object

13. Drop column annual_salary from emp_info

In [50]:
emp_info.drop(columns='annual_salary')

  firstname    zip
0     Nancy  98122
1    Andrew  98401
2     Janet  98033
3  Margaret  98052
4    Steven  98051